app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = 'justin', "last_name" = 'FAGGNUT', "major" = 'BJ' WHERE "students"."id" = 4
---
  def editStudent
    id = params[:student_id]
    fn = params[:first_name]
    ln = params[:last_name]
    maj = params[:major]
    @student = Student.update(id,{:first_name => fn, :last_name => ln, :major => maj})